#include <stdio.h>

// 작성자: 양사무엘
// 작성일: 2026-09-30
// 공부 내용: 변수의 이해

// [변수란 무엇인가?]
// 값을 저장할 수 있는 메모리 공간에 붙은 이름, 혹은 메모리 공간 자체를 가리켜 변수라 한다.

// [왜 필요한가?]
// 프로그램에서 값을 저장하고, 그 값을 이름(변수의 이름)으로 다시 사용하기 위해서이다. 
// 더 자세히는 변수를 통해 이전의 정보를 기억하고 시간에 따라 변하는 상태를 유지할 수 있기 때문이다.

// [어떻게 변수를 만드는가? (선언)]
void Example(void)
{
    int num; // num이라는 이름의 변수선언
}
// 변수에 저장할 값의 타입과 이름을 가지고 선언한다.


// [어떻게 변수에 값을 넣는가? (초기화와 대입)]
// '='연산자를 통해 변수에 값을 넣을 수 있다.
// 초기화 : 선언된 변수에 처음 값을 저장하는 것
// 대입 : 변수에 값을 넣거나 변경하는 것
void Initialize(void)
{
    int num; // num이라는 변수의 선언
    num = 5; // 변수 num을 5로 '초기화', 5를 대입하는 것이기도 하다.
    num = 20; // 변수 num에 20을 '대입'

    int num2 = 40; // 선언과 동시에 초기화하는 것이 가능하다.
}