#include <stdio.h>

// 작성자: 양사무엘
// 작성일: 2026-10-01
// 공부 내용: 포인터와 함수를 연결지어 이해하기


// [함수란 무엇인가?]
// 어떤 기능을 하도록 만든 코드의 묶음이다.

// [왜 함수를 만드는가?]
// 하나의 큰 문제를 작은 문제들로 나누어 해결할 수 있기 때문이다.
// 프로그램을 작은 크기의 함수들로 나눠서 구현하면 문제 발생시 변경의 범위를 축소 및 제한할 수 있기 때문이다.

// [함수의 형태]
// 함수의 형태는 다음과 같다.
// 반환형 함수이름(입력형태)
// {
        // 함수의 몸체
// }
// 여기서 전달인자와 반환 값은 있을 수도 있고 없을 수도 있다.
// return 키워드를 통해 값을 반환하면서 함수를 빠져나갈 수 있다.

// [인자전달의 기본 방식]
// 기본적으로 함수호출 시 전달되는 인자의 값은 매개변수에 `복사`가 된다.
// 즉 함수 내부에서 매개변수의 값을 바꾼다고 외부에서 인자로 넘겨준 원본 변수는 변화되지 않는다는 것이다.

void Swap(int num1, int num2)
{
    int temp = num1;
    num1 = num2;
    num2 = temp;
}
void TrySwapMethod(void)
{
    int num1 = 5;
    int num2 = 10;
    Swap(num1, num2); // 값이 서로 바뀌길 기대
    printf("%d %d \n", num1, num2); // 5 10 출력, 바뀌지 않음!
}
// 외부 변수의 값이 바뀌지 않는 이유는 함수에 전달되어지는 것이 외부변수 자체가 아니라 변수의 값만 함수의 매개변수로 복사되어 전달되는것이기 때문이다.
// 어떻게 변경해야 원하는 결과를 얻을 수 있을까?
// Swap함수의 전달인자로 주소값을 넘겨주면 된다.
void Swap2(int* num1, int* num2)
{
    int temp = *num1;
    *num1 = *num2;
    *num2 = temp;
}
void TrySwapMethod2(void)
{
    int num1 = 5;
    int num2 = 10;
    Swap2(&num1, &num2); // 이번엔 바뀌나??
    printf("%d %d \n", num1, num2); // 10 5 출력, 바뀌었음!
}
// 출력값을 확인하면 값이 서로 바뀐 것을 확인할 수 있다.


int main(void)
{
    TrySwapMethod();
    TrySwapMethod2();
    return 0;
}