#include <stdio.h>

// 작성자: 양사무엘
// 작성일: 2026-10-06
// 공부 내용: 배열과 포인터에 대한 이해 심화, 그리고 선언과 문법과 타입

// [배열 표현]
void ArrayExpression(void)
{
    // int형 값을 5개 가지는 배열 변수 arr 선언 + 각 요소 값 초기화
    int arr[] = {1,2,3,4,5};

    int * arrptr = arr; // 여기서 arr은 int* 타입인걸 확인할 수 있다.
    int (*arrptr2)[5] = &arr; // 여기서 &arr은 int (*)[5] 타입인걸 확인할 수 있다.
    // 배열 변수는 그 자체로 배열 객체이지만 특정 표현식에서 포인터 형식으로 변환되어 사용되어진다. 이는 c언어 규칙으로 정해져있다.

    // arr: 첫 요소를 가리키는 int*로 변환된다.
    // &arr: 배열 전체를 가리키는 int (*)[5]를 얻는다.
    // 가리키는 대상의 타입은 다르지만 시작 위치는 같다.
    printf("%p %p \n", arr, &arr); // 두 출력 값이 서로 같음

    printf("%p %p \n", &arr + 1, (&arr)[1]); // 위 출력 값에 20(sizeof(int)*5)만큼 더해진 값이 나온다.
    printf("%p %p \n", &(*(arr+1)), &arr[1]); // 위 출력 값에 4(sizeof(int)*1)만큼 더해진 값이 나온다.

    // sizeof(arr): 배열 전체 크기 → 5 * sizeof(int). int [5] 크기 반환
    // sizeof(&arr): 배열 전체를 가리키는 포인터 타입의 크기. int (*) [5]의 크기 반환
    printf("%zu %zu \n", sizeof(arr), sizeof(&arr)); // 20 8 출력. (64bit 운영체제여서 포인터 타입의 크기는 8이 된다.)
}
// 배열은 일부 표현식에서 포인터 타입으로 변환되어 사용된다.
// sizeof(arr)에서 arr은 int[5]타입이고 printf에서 arr은 int* 타입으로 사용되어진다.


// [타입이란 무엇인가?]
// 일반적으로 프로그래밍에서 타입(type)을 자료형으로 부른다. 타입은 컴퓨터가 데이터를 어떻게 해석하고 다루어야 하는지 규정하는 분류체계이다.
// 데이터가
// - 어떤 값을 다루는가?
// - 어떤 연산을 할 수 있는가?
// - 연산의 결과 타입은 무엇인가?
// - 객체의 크기와 정렬 조건은 무엇인가?
// 등에 대한 기준을 가지고 있는 것이 타입이다.

// [변수와의 차이점은 무엇인가?]
// 변수는 '타입의 크기'만큼의 메모리 공간에 붙은 '이름'이다.
// 타입은 변수에 위치한 값을 어떻게 사용할 수 있는지에 대한 '기준'이다.

// [이 기준은 어디에 누가 관리하는가?]
// 내 생각으로는 컴파일러 내부의 규칙을 통해 관리되어지는데 이 규칙은 언어의 문법을 따른다. 사람들(개발자)이 정한 규칙을 따르는 것이다.
// 결국에 컴퓨터가 이해한다는 말도 사람들이 정한 규칙 아래에서 이해한다라고 표현하는 것이지 컴퓨터가 진짜로 '이해'하는 것은 아니다. 컴퓨터는 규칙을 따를 뿐이다. 



// 각 선언은 C의 규칙에서 어떤 의미를 가지고 있는가?
// 각 코드는 선언의 방식에 따라, 또 문법 결합에 따라 가지는 의미가 달라진다.
// 이를 이해하기 위해서 다양한 방식과 종류의 선언을 살펴보며 그것이 가지는 의미를 적어본다.
void VariousDeclaration(void)
{
    int num; // int형 값을 저장하는 변수 num 선언

    int nArr[5]; // int형 값을 5개를 저장하는 배열 nArr 선언

    int * pnum; // int값이 위치한 주소를 저장하는 포인터 변수 pnum 선언 

    int (*pnum2); // 이것도 위와 동일함

    int (*arrptr) [5]; // int값을 5개를 보유하는 배열(의 첫 요소값의 주소가 아닌 배열 그 자체)의 주소를 저장하는 변수 (*arrptr) 선언 / 괄호로 감싼 이유는 포인터 배열과 구분하기 위함임

    int * ptrarr[5]; // int*형 값을 5개를 저장하는 배열 ptrarr 선언
}
// 선언만 보면은 이해하기가 좀 어려울 수 있는데 관점을 좀 바꿔 생각하면 선언은 어떻게 하면 해당 타입의 값을 얻을 수 있는지를 나타내주는 식이기도 하다. 즉 변수를 어떻게 사용하면 해당 타입의 값이 나오는가를 선언은 반영한다는 것이다.
// 예를 들어 int num은 num이라는 변수를 사용하면 int형 값을 얻을 수 있고 int * pnum은 pnum을 역참조하면 int형 값을 얻을 수 있다는 점이다.

int main(void)
{
    ArrayExpression();
    return 0;
}

