#include <stdio.h>

// 작성자: 양사무엘
// 작성일: 2026-10-06
// 공부 내용: 배열과 포인터에 대한 이해 심화, 그리고 타입과 문법과 선언

// [배열 표현]
void ArrayExpression(void)
{
    // int형 값을 5개 가지는 배열 변수 arr 선언 + 각 요소 값 초기화
    int arr[] = {1,2,3,4,5};
    // arr은 그 자체로 배열 객체를 나타내는 변수이다. 배열을 가리키는 포인터가 아니다.
    // 하지만 특정 표현식에서 포인터 타입으로 변환되어 사용되어진다. 이는 c언어 규칙으로 정해져있다.
    // 표현식에서 변환되어진 arr은 &arr[0]과 같다. 둘 다 같은 int* 타입이다.

    // arr는 int[5] 배열 객체를 나타낸다.
    // 대부분의 표현식에서는 첫 요소의 포인터 int*로 변환된다.
    int * arrptr = arr;

    // &arr에서는 배열→포인터 변환 없이 배열 전체의 주소를 구한다.
    int (*arrptr2)[5] = &arr;
    
    // 가리키는 대상의 타입은 다르지만 시작 위치는 같다.
    printf("%p %p \n", arr, &arr); // 두 타입의 값의 주소 출력 값이 서로 같음

    // 포인터 값에 + 1을 하면 포인터가 가리키는 값의 타입 크기만큼 더해진다. sizeof(type) * i만큼 커지는 것이다.
    // 그렇기에 arr에 +1을 해보고 해당 주소값이 얼마나 커지는지를 보면 어떤 타입을 대상으로 표현식이 진행되어졌는지를 볼 수 있다.
    printf("%p %p \n", &arr + 1, &(&arr)[1]); // 위 출력 값에 20(sizeof(int)*5)만큼 더해진 값이 나온다. 즉 int(*)[5] 타입의 값을 대상으로 진행되어졌다.
    printf("%p %p \n", arr + 1, &arr[1]); // 위 출력 값에 4(sizeof(int)*1)만큼 더해진 값이 나온다. // 즉 int* 타입의 값을 대상으로 진행되어졌다.

    
    printf("%zu %zu \n", sizeof(arr), sizeof(&arr)); // 20 8 출력. (64bit 운영체제여서 포인터 타입의 크기는 8이 된다.)
    // sizeof(arr): 배열 전체 크기 → 5 * sizeof(int). int [5] 크기 반환. 여기서 배열은 포인터 타입으로의 변환이 일어나지 않고 배열 그 자체 타입으로 사용되어졌다!
    // sizeof(&arr): 배열 전체를 가리키는 포인터 타입의 크기. int (*) [5]의 크기 반환
}



// [타입이란 무엇인가?]
// 일반적으로 프로그래밍에서 타입(type)을 자료형으로 부른다. 타입은 컴파일러가 데이터를 어떻게 해석하고 다루어야 하는지 규정하는 분류체계이다.
// 데이터가
// - 어떤 값을 다루는가?
// - 어떤 연산을 할 수 있는가?
// - 연산의 결과 타입은 무엇인가?
// - 객체의 크기와 정렬 조건은 무엇인가?
// 등에 대한 기준을 가지고 있는 것이 타입이다.

// [변수와의 차이점은 무엇인가?]
// 변수는 값을 저장하고 이름을 통해 접근할 수 있게 하는 수단이며, 각각 선언된 타입을 가진다.
// 타입은 그 변수를 통해 어떤 값을 다루고 어떤 연산을 할 수 있는지 정한다.

// [이 기준은 어디에 누가 관리하는가?]
// C 언어의 명세가 타입과 연산의 규칙을 정한다.
// 컴파일러는 그 규칙에 따라 선언과 표현식의 타입을 분석하고, 허용되는 사용인지 검사하며 기계어를 생성한다.
// 언어가 구현에 맡긴 사항은 컴파일러와 대상 실행 환경에 따라 결정된다.

// CPU는 일반적으로 소스 코드의 변수 이름이나 C 타입을 확인하지 않는다.
// 컴파일러가 타입에 맞게 생성한 기계 명령어를 실행한다.



// [문법이란 무엇인가?]
// 문법은 언어의 기호들을 어떤 순서와 구조로 조합할 수 있는지 정한 규칙이다. 
// 프로그래밍 언어에서는 "어떤 모양의 코드가 올바른 문장인가?"를 정한다.



// [선언이란 무엇인가?]
// 선언은 코드에서 사용할 이름을 도입하거나 다시 알리고, 그 이름이 무엇을 뜻하는지 정보를 제공하는 것이다.

// 각 선언은 C의 규칙(문법)에서 어떤 의미를 가지고 있는가?
// 각 코드는 선언의 방식에 따라, 또 문법 결합에 따라 가지는 의미가 달라진다.
// 이를 이해하기 위해서 다양한 방식과 종류의 선언을 살펴보며 그것이 가지는 의미를 적어본다.
void VariousDeclaration(void)
{
    int num; // int형 값을 저장하는 변수 num 선언

    int nArr[5]; // int형 값을 5개를 저장하는 배열 nArr 선언

    int * pnum; // int값이 위치한 주소를 저장하는 포인터 변수 pnum 선언 

    int (*pnum2); // 이것도 위와 동일함
    
    int * ptrarr[5]; // int*형 값을 5개를 저장하는 배열 ptrarr 선언

    int (*arrptr) [5]; // int값을 5개를 보유하는 배열(의 첫 요소값의 주소가 아닌 배열 그 자체)의 주소를 저장하는 변수 arrptr 선언 / 괄호로 감싼 이유는 포인터 배열과 구분하기 위함임
}
// 선언만 보면은 이해하기가 좀 어려울 수 있는데 관점을 좀 바꿔 생각하면 선언은 어떻게 하면 해당 타입의 값을 얻을 수 있는지를 나타내주는 식이기도 하다. 즉 변수를 어떻게 사용하면 해당 타입의 값이 나오는가를 선언은 반영한다는 것이다.
// 예를 들어 int num은 num이라는 변수를 사용하면 int형 값을 얻을 수 있고 int * pnum은 pnum을 역참조하면 int형 값을 얻을 수 있다는 점이다.

int main(void)
{
    ArrayExpression();
    return 0;
}

