#include <stdio.h>

// 작성자: 양사무엘
// 작성일: 2026-10-08
// 공부 내용: 스트림과 데이터의 이동 이해

// [스트림(Stream)이란?]
// 스트림은 프로그램에서 입출력 대상으로 데이터를 입출력하기 위해 이들을 연결시켜주는 매개체이다.


// [스트림을 통해 무엇을 할 수 있는가?]
// 입력원에서 데이터를 읽거나 출력 대상에 데이터를 쓸 수 있다. 읽기와 쓰기를 모두 지원하는지, 위치 이동이 가능한지 등의 기능은 스트림에 따라 다르다.
// 사용하는 코드는 스트림의 사용 규칙을 지키고, 입출력 결과와 오류를 확인하며, 데이터를 약속된 형식으로 해석해야 한다.


// [입출력이란 무엇인가?]
// 데이터의 입력과 출력은 프로그램의 흐름을 뜻하는 것이다. 프로그램을 중심으로 프로그램 안으로 데이터가 들어오는 것이 입력이고, 프로그램 밖으로 데이터가 흘러 나가는 것이 출력이다.
// 입출력의 대상은 매우 넓고 또 그만큼 입출력에는 포괄적인 의미가 담겨있다.


// [스트림을 사용하는 이유가 무엇인가?]
// 프로그램이 입출력 대상의 세부적인 처리 방식에 덜 의존하면서 데이터를 읽고 쓸 수 있도록 하기 위해서이다.

// [C에서 제공하는 표준 입출력 스트림]
// C에서는 표준 입출력 대상과 프로그램을 연결지어주는 스트림을 자동 생성해준다. 또 stdio 라이브러리를 통해 표준 스트림을 사용하거나 추가 스트림을 열고 닫을 수 있도록 기능을 제공해준다.

// 기본적으로 따로 설정하지 않았다면 표준 입출력 대상은 키보드와 모니터이다.
// stdin - 표준 입력 스트림 - 키보드 대상으로 입력
// stdout - 표준 출력 스트림 - 모니터 대상으로 출력
// stderr - 표준 에러 스트림 - 모니터 대상으로 출력

// [stdio.h]
// c에서 기본 제공되어지는 stdio 라이브러리의 헤더파일로, 스트림 연결/해제 및 스트림을 통한 입출력을 지원한다.

// [문자 단위 입출력 함수]
// stdio(Standard Input/Output)헤더 파일이 제공하는 문자 출력 함수는 다음과 같다.
int putchar(int c);
int fputc(int c, FILE * stream);
// `putchar`함수는 인자로 전달된 문자 정보를 표준 출력 스트림으로 전송하는 함수이다.
// 반면에 `fputc`함수는 문자를 전송할 스트림을 지정할 수 있다.

// 문자 입력 함수는 다음과 같다.
int getchar(void);
int fgetc(FILE * stream);
// `getchar`함수는 표준 입력 스트림으로부터 하나의 문자를 입력 받아서 반환하는 함수이다.
// `fgetc`함수도 문자를 입력 받지만 문자를 입력 받을 스트림을 지정할 수 있다.

void IOTest(void)
{
    int ch1, ch2;

    ch1 = getchar();
    ch2 = fgetc(stdin);

    putchar(ch1);
    fputc(ch2, stdout);
}
// enter키 또한 입력이다.

// [문자 입출력에서의 EOF]
// EOF는 End Of File의 약자로서, 파일의 끝을 표현하기 위해서 정의해 놓은 상수이다.
// 따라서 파일을 대상으로 fgetc 함수가 호출되면, 그리고 그 결과로 EOF가 반환되면, 이는 '파일의 끝에 도달해서 더 이상 읽을 내용이 없다'는 뜻이 된다.

// 함수호출의 실패가 일어나거나 특정 키가 입력되는 경우 반환되어진다.
// Window : CTRL + Z / Linux : CTRL + D
void EOFTest(void)
{
    int ch;

    while(1)
    {
        ch=getchar();
        if(ch==EOF) break;
        putchar(ch);
    }
}


// [문자열 단위 입출력 함수]
int puts(const char * s);
int fputs(const char * s, FILE * stream);
// 마찬가지로 stream 인자를 통해 출력의 대상을 결정할 수 있다.
// puts를 통해 출력을 하면 자동으로 개행이 이뤄지지만, fputs로 출력을 하면 자동으로 개행이 이루어지지 않는다.

char * gets(char * s);
char * fgets(char * s, int n, FILE * stream);
// gets 함수는 마련해 놓은 배열을 넘어서는 길이의 문자열이 입력되면 정의되지 않은 동작이 된다. 그렇기에 가급적 fgets함수를 호출하는 것이 좋다.
void StrGetsError(void)
{
    // 컴파일 경고가 뜸. fgets사용을 권장하는 경고임.
    char str[5];
    gets(str);
    printf("%s \n", str); // 현재 환경에서는 입력을 받는대로 출력을 해주긴 하나, 이는 정의되지 않은 동작임
}

// fgets 함수는 \n을 만날 때까지 문자열을 읽어 들이는데, \n을 제외시키거나 버리지 않고 문자열의 일부로 받아들인다.
void FGetsMethodTest(void)
{
    char str[7];
    int i;

    for(i=0; i<3; i++)
    {
        fgets(str, sizeof(str), stdin);
        printf("read %d: %s \n", i+1, str); // 임의 입력시 개행이 두번 이루어지는것을 확인할 수 있다.
    }
}


// [표준 입출력과 버퍼]
// 위 함수들을 모두 `표준 입출력 함수`라 한다. 이 함수들을 통해 데이터를 입출력 하는 경우 이 데이터들은 운영체제가 제공하는 '메모리 버퍼'를 중간에 통과하게 된다.
// '메모리 버퍼'는 데이터를 임시로 모아두는(저장하는) 메모리 공간이다. 
// 데이터들이 이곳을 거쳐야 하는 이유가 뭘까? 여러 이유가 있지만 가장 큰 이유는 '데이터 전송의 효율성'때문이다.
// 외부 장치와의 데이터 입출력은 생각보다 시간이 걸리는 작업이다. 따라서 버퍼를 두어서 데이터를 한데 묶어서 이동시키는것이 입력을 받을때마다 이동시키는 것보다 효율적이고 빠르다.


void FileInputTest(void)
{
    FILE* fp = fopen("Example02.txt", "wb");
    fputs(" Success! \n", fp);
    fputs(" Test \n", fp);
    fclose(fp);
}


typedef struct Connection Connection;
int main(void)
{
    FileInputTest();
    return 0;
}