#include <stdio.h>

// 작성자: 양사무엘
// 작성일: 2026-10-27
// 공부 내용: 열거형의 정의와 이해

// [열거형이란?]
// 관련된 정수 상수들에 이름을 붙여 하나의 타입으로 묶는 문법이다.

// [왜 필요한가?]
// 둘 이상의 연관이 있는 이름을 상수로 선언함으로써 프로그램의 가독성을 높여주기 때문이다.

// 예를 들어 동물의 종류를 상수로 정할때 개는 1, 고양이는 2, 오리는 3 이런식으로 정해놓고 코드상에서 숫자로 사용한다면 나중에 와서 볼때는 무엇을 의미하는지 이해하기 힘들어질 것이다. 그러나 열거형을 통해 Dog, Cat, Duck처럼 이름을 통해 사용한다면 가독성이 좋아질 뿐더러 코드상에서 상수의 역할도 하는 것이다.

// [어떻게 정의하고 사용하는가?]
// 상수를 선언하고 값을 할당해 선언해준다. 값을 할당하지 않으면 0부터 차례대로 1증가된 값을 할당해준다.
enum animal
{
    Dog = 1,
    Cat = 2,
    Duck = 3
};

enum family
{
    Father, // 0
    Mother, // 1
    Brother, // 2
    Sister, // 3
};

int main(void)
{
    
    return 0;
}